espressif/esp-idf/components/soc/esp32h21/register/soc/pcr_reg.h
/** PCR_SYSCLK_CONF_REG register
 *  SYSCLK configuration register
 */
#define PCR_SYSCLK_CONF_REG (DR_REG_PCR_BASE + 0x10c)
/** PCR_SOC_CLK_SEL : R/W; bitpos: [17:16]; default: 0;
 *  This field is used to select clock source. 0: XTAL, 1: SPLL, 2: FOSC, 3: reserved.
 */
#define PCR_SOC_CLK_SEL    0x00000003U
#define PCR_SOC_CLK_SEL_M  (PCR_SOC_CLK_SEL_V << PCR_SOC_CLK_SEL_S)
#define PCR_SOC_CLK_SEL_V  0x00000003U
#define PCR_SOC_CLK_SEL_S  16
/** PCR_CLK_XTAL_FREQ : RO; bitpos: [30:24]; default: 32;
 *  This field indicates the frequency(MHz) of XTAL.
 */
#define PCR_CLK_XTAL_FREQ    0x0000007FU
#define PCR_CLK_XTAL_FREQ_M  (PCR_CLK_XTAL_FREQ_V << PCR_CLK_XTAL_FREQ_S)
#define PCR_CLK_XTAL_FREQ_V  0x0000007FU
#define PCR_CLK_XTAL_FREQ_S  24

/** PCR_CPU_WAITI_CONF_REG register
 *  CPU_WAITI configuration register
 */
#define PCR_CPU_WAITI_CONF_REG (DR_REG_PCR_BASE + 0x110)
/** PCR_CPU_WAIT_MODE_FORCE_ON : R/W; bitpos: [3]; default: 1;
 *  Set 1 to force cpu_waiti_clk enable.
 */
#define PCR_CPU_WAIT_MODE_FORCE_ON    (BIT(3))
#define PCR_CPU_WAIT_MODE_FORCE_ON_M  (PCR_CPU_WAIT_MODE_FORCE_ON_V << PCR_CPU_WAIT_MODE_FORCE_ON_S)
#define PCR_CPU_WAIT_MODE_FORCE_ON_V  0x00000001U
#define PCR_CPU_WAIT_MODE_FORCE_ON_S  3
/** PCR_CPU_WAITI_DELAY_NUM : R/W; bitpos: [7:4]; default: 0;
 *  This field used to set delay cycle when cpu enter waiti mode, after delay waiti_clk
 *  will close
 */
#define PCR_CPU_WAITI_DELAY_NUM    0x0000000FU
#define PCR_CPU_WAITI_DELAY_NUM_M  (PCR_CPU_WAITI_DELAY_NUM_V << PCR_CPU_WAITI_DELAY_NUM_S)
#define PCR_CPU_WAITI_DELAY_NUM_V  0x0000000FU
#define PCR_CPU_WAITI_DELAY_NUM_S  4

/** PCR_CPU_FREQ_CONF_REG register
 *  CPU_FREQ configuration register
 */
#define PCR_CPU_FREQ_CONF_REG (DR_REG_PCR_BASE + 0x114)
/** PCR_CPU_DIV_NUM : R/W; bitpos: [7:0]; default: 0;
 *  Set this field to generate clk_cpu driven by clk_hproot. The clk_cpu is
 *  div1(default)/div2/div4 of clk_hproot. This field is only available for low-speed
 *  clock-source such as XTAL/FOSC, and should be used together with PCR_AHB_DIV_NUM.
 */
#define PCR_CPU_DIV_NUM    0x000000FFU
#define PCR_CPU_DIV_NUM_M  (PCR_CPU_DIV_NUM_V << PCR_CPU_DIV_NUM_S)
#define PCR_CPU_DIV_NUM_V  0x000000FFU
#define PCR_CPU_DIV_NUM_S  0

/** PCR_AHB_FREQ_CONF_REG register
 *  AHB_FREQ configuration register
 */
#define PCR_AHB_FREQ_CONF_REG (DR_REG_PCR_BASE + 0x118)
/** PCR_AHB_DIV_NUM : R/W; bitpos: [7:0]; default: 0;
 *  Set this field to generate clk_ahb driven by clk_hproot. The clk_ahb is
 *  div1(default)/div2/div4/div8 of clk_hproot. This field is only available for
 *  low-speed clock-source such as XTAL/FOSC, and should be used together with
 *  PCR_CPU_DIV_NUM.
 */
#define PCR_AHB_DIV_NUM    0x000000FFU
#define PCR_AHB_DIV_NUM_M  (PCR_AHB_DIV_NUM_V << PCR_AHB_DIV_NUM_S)
#define PCR_AHB_DIV_NUM_V  0x000000FFU
#define PCR_AHB_DIV_NUM_S  0

/** PCR_APB_FREQ_CONF_REG register
 *  APB_FREQ configuration register
 */
#define PCR_APB_FREQ_CONF_REG (DR_REG_PCR_BASE + 0x11c)
/** PCR_APB_DECREASE_DIV_NUM : R/W; bitpos: [7:0]; default: 0;
 *  If this field's value is grater than PCR_APB_DIV_NUM, the clk_apb will be
 *  automatically down to clk_apb_decrease only when no access is on apb-bus, and will
 *  recover to the previous frequency when a new access appears on apb-bus. Set as one
 *  within (0,1,3) to set clk_apb_decrease as div1/div2/div4(default) of clk_ahb. Note
 *  that enable this function will reduce performance. Users can set this field as zero
 *  to disable the auto-decrease-apb-freq function. By default, this function is
 *  disable.
 */
#define PCR_APB_DECREASE_DIV_NUM    0x000000FFU
#define PCR_APB_DECREASE_DIV_NUM_M  (PCR_APB_DECREASE_DIV_NUM_V << PCR_APB_DECREASE_DIV_NUM_S)
#define PCR_APB_DECREASE_DIV_NUM_V  0x000000FFU
#define PCR_APB_DECREASE_DIV_NUM_S  0
/** PCR_APB_DIV_NUM : R/W; bitpos: [15:8]; default: 0;
 *  Set as one within (0,1,3) to generate clk_apb driven by clk_ahb. The clk_apb is
 *  div1(default)/div2/div4 of clk_ahb.
 */
#define PCR_APB_DIV_NUM    0x000000FFU
#define PCR_APB_DIV_NUM_M  (PCR_APB_DIV_NUM_V << PCR_APB_DIV_NUM_S)
#define PCR_APB_DIV_NUM_V  0x000000FFU
#define PCR_APB_DIV_NUM_S  8

/** PCR_SYSCLK_FREQ_QUERY_0_REG register
 *  SYSCLK frequency query 0 register
 */
#define PCR_SYSCLK_FREQ_QUERY_0_REG (DR_REG_PCR_BASE + 0x120)
/** PCR_FOSC_FREQ : HRO; bitpos: [7:0]; default: 8;
 *  This field indicates the frequency(MHz) of FOSC.
 */
#define PCR_FOSC_FREQ    0x000000FFU
#define PCR_FOSC_FREQ_M  (PCR_FOSC_FREQ_V << PCR_FOSC_FREQ_S)
#define PCR_FOSC_FREQ_V  0x000000FFU
#define PCR_FOSC_FREQ_S  0
/** PCR_PLL_FREQ : HRO; bitpos: [17:8]; default: 96;
 *  This field indicates the frequency(MHz) of SPLL.
 */
#define PCR_PLL_FREQ    0x000003FFU
#define PCR_PLL_FREQ_M  (PCR_PLL_FREQ_V << PCR_PLL_FREQ_S)
#define PCR_PLL_FREQ_V  0x000003FFU
#define PCR_PLL_FREQ_S  8

/** PCR_PLL_DIV_CLK_EN_REG register
 *  SPLL DIV clock-gating configuration register
 */
#define PCR_PLL_DIV_CLK_EN_REG (DR_REG_PCR_BASE + 0x124)
/** PCR_PLL_96M_CLK_EN : R/W; bitpos: [0]; default: 1;
 *  This field is used to open 96 MHz clock (SPLL) driven from SPLL. 0: close, 1:
 *  open(default). Only available when high-speed clock-source SPLL is active.
 */
#define PCR_PLL_96M_CLK_EN    (BIT(0))
#define PCR_PLL_96M_CLK_EN_M  (PCR_PLL_96M_CLK_EN_V << PCR_PLL_96M_CLK_EN_S)
#define PCR_PLL_96M_CLK_EN_V  0x00000001U
#define PCR_PLL_96M_CLK_EN_S  0
/** PCR_PLL_64M_CLK_EN : R/W; bitpos: [1]; default: 1;
 *  This field is used to open 64 MHz clock (XTALX2) driven from XTALX2. 0: close,
 *  1: open(default). Only available when high-speed clock-source SPLL is active.
 */
#define PCR_PLL_64M_CLK_EN    (BIT(1))
#define PCR_PLL_64M_CLK_EN_M  (PCR_PLL_64M_CLK_EN_V << PCR_PLL_64M_CLK_EN_S)
#define PCR_PLL_64M_CLK_EN_V  0x00000001U
#define PCR_PLL_64M_CLK_EN_S  1
/** PCR_PLL_48M_CLK_EN : R/W; bitpos: [2]; default: 1;
 *  This field is used to open 48 MHz clock (div2 of SPLL) driven from SPLL. 0: close,
 *  1: open(default). Only available when high-speed clock-source SPLL is active.
 */
#define PCR_PLL_48M_CLK_EN    (BIT(2))
#define PCR_PLL_48M_CLK_EN_M  (PCR_PLL_48M_CLK_EN_V << PCR_PLL_48M_CLK_EN_S)
#define PCR_PLL_48M_CLK_EN_V  0x00000001U
#define PCR_PLL_48M_CLK_EN_S  2
/** PCR_PLL_32M_CLK_EN : R/W; bitpos: [3]; default: 1;
 *  This field is used to open 32 MHz clock (div2 of XTALX2) driven from XTALX2. 0: close,
 *  1: open(default). Only available when high-speed clock-source SPLL is active.
 */
#define PCR_PLL_32M_CLK_EN    (BIT(3))
#define PCR_PLL_32M_CLK_EN_M  (PCR_PLL_32M_CLK_EN_V << PCR_PLL_32M_CLK_EN_S)
#define PCR_PLL_32M_CLK_EN_V  0x00000001U
#define PCR_PLL_32M_CLK_EN_S  3
/** PCR_PLL_16M_CLK_EN : R/W; bitpos: [4]; default: 1;
 *  This field is used to open 16 MHz clock (div6 of SPLL) driven from SPLL. 0: close,
 *  1: open(default). Only available when high-speed clock-source SPLL is active.
 */
#define PCR_PLL_16M_CLK_EN    (BIT(4))
#define PCR_PLL_16M_CLK_EN_M  (PCR_PLL_16M_CLK_EN_V << PCR_PLL_16M_CLK_EN_S)
#define PCR_PLL_16M_CLK_EN_V  0x00000001U
#define PCR_PLL_16M_CLK_EN_S  4
/** PCR_PLL_8M_CLK_EN : R/W; bitpos: [5]; default: 1;
 *  This field is used to open 8 MHz clock (div12 of SPLL) driven from SPLL. 0: close,
 *  1: open(default). Only available when high-speed clock-source SPLL is active.
 */
#define PCR_PLL_8M_CLK_EN    (BIT(5))
#define PCR_PLL_8M_CLK_EN_M  (PCR_PLL_8M_CLK_EN_V << PCR_PLL_8M_CLK_EN_S)
#define PCR_PLL_8M_CLK_EN_V  0x00000001U
#define PCR_PLL_8M_CLK_EN_S  5

